app/Controllers/ADMIN/FeedbackController.php

SELECT *
FROM `feedback`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $model = new FeedbackModel();

        // Ambil semua data
        $feedbacks = $model->findAll();