app/Controllers/AdminValidasi.php

SELECT *
FROM `pendaftaran`
ORDER BY `id_pendaftaran` DESC
SELECT *
FROM `pendaftaran`
WHERE `id_pendaftaran` = 6
SELECT *
FROM `tbl_dokumen`
WHERE `pendaftaran_id` = 6
---
    public function index()
    {
        $db = db_connect();

        // daftar pendaftar
        $rows = $db->table('pendaftaran')
            ->orderBy('id_pendaftaran', 'DESC')
            ->get()->getResultArray();

        // ambil detail berdasarkan query string ?id=
        $id = (int) ($this->request->getGet('id') ?? 0);

        $detail = null;
        $dok = [];

        if ($id > 0) {
            $detail = $db->table('pendaftaran')
                ->where('id_pendaftaran', $id)
                ->get()->getRowArray();

            if ($detail) {
                $dok = $db->table('tbl_dokumen')
                    ->where('pendaftaran_id', $id)
                    ->get()->getResultArray();