app/Controllers/InformasiPpdb.php

    public function index()
    {
        // Ambil pengumuman TERBARU tanpa asumsi nama kolom tanggal/slug
        // hanya ambil 10 data terakhir berdasarkan id (pasti ada)
        $pengumuman = $this->db->table('pengumuman')
            ->orderBy('id', 'DESC')
            ->limit(10)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `pengumuman`
ORDER BY `id` DESC
 LIMIT 10