app/Controllers/Pendaftaran.php

    public function index()
    {
        $db = db_connect();

        $data = [];
        $data['sekolah'] = $db->table('tbl_datasekolah')->get()->getResultArray();
        $data['jalur']   = $db->table('tbl_jalur')->where('aktif', 1)->get()->getResultArray();
---
SELECT *
FROM `tbl_datasekolah`
SELECT *
FROM `tbl_jalur`
WHERE `aktif` = 1