app/Controllers/Profile.php

SELECT *
FROM `tbl_user_profile`
WHERE `id_user` = '6'
 LIMIT 1
INSERT INTO `tbl_user_profile` (`id_user`, `nama_lengkap`, `created_at`, `updated_at`) VALUES ('6', 'admin@gmail.com', '2026-01-21 04:58:56', '2026-01-21 04:58:56')
---
    public function index()
    {
        // pastikan login (sesuai Auth: session key = 'login')
        if (!session()->get('login')) {
            return redirect()->to(base_url('auth/login'));
        }

        $id_user = session()->get('id_user');
        $profileModel = new ModelUserProfile();

        // ambil profil
        $profile = $profileModel->where('id_user', $id_user)->first();

        // kalau belum ada profil -> buat otomatis
        if (!$profile) {
            $profileModel->insert([
                'id_user'      => $id_user,
                'nama_lengkap' => session()->get('nama_user') ?? 'Siswa'
            ]);

            $profile = $profileModel->where('id_user', $id_user)->first();