app/Controllers/Validasi.php

SELECT *
FROM `pendaftaran`
WHERE `id_user` = 6
ORDER BY `id_pendaftaran` DESC
---
    public function index()
    {
        $db = db_connect();

        // ✅ wajib login (sesuai Auth kamu)
        $idUser = session()->get('id_user');
        if (!$idUser) {
            return redirect()->to(base_url('auth/login'))
                ->with('error', 'Silakan login dulu.');
        }

        // ✅ Ambil pendaftaran terakhir milik user ini
        $pendaftaran = $db->table('pendaftaran')
            ->where('id_user', (int) $idUser)
            ->orderBy('id_pendaftaran', 'DESC')
            ->get()
            ->getRowArray();

SELECT *
FROM `tbl_dokumen`
WHERE `pendaftaran_id` = '6'
SELECT *
FROM `tbl_log`
WHERE `pendaftaran_id` = '6'
ORDER BY `waktu` DESC
---
        ]);

        // Ambil dokumen pendaftaran ini
        $dokumen = $db->table('tbl_dokumen')
            ->where('pendaftaran_id', (int) $pendaftaran['id_pendaftaran'])
            ->get()
            ->getResultArray();

        // Ambil log pendaftaran ini
        $log = $db->table('tbl_log')
            ->where('pendaftaran_id', (int) $pendaftaran['id_pendaftaran'])
            ->orderBy('waktu', 'DESC')
            ->get()
            ->getResultArray();