app/Controllers/Validasi.php

SELECT *
FROM `pendaftaran`
WHERE `nisn` = '1221212121'
ORDER BY `id_pendaftaran` DESC
---
    public function index()
    {
        $db = db_connect();

        // Ambil identitas user dari session (sesuaikan dengan session login kamu)
        $userId = session()->get('user_id');
        $nisn   = session()->get('nisn'); // kalau kamu simpan nisn di session

        /**
         * Pilihan A (disarankan): ambil berdasarkan user_id
         * tapi tabel pendaftaran kamu belum ada kolom user_id.
         * Jadi sekarang kita pakai NISN.
         */

        if (!$nisn) {
            // fallback: kalau session belum menyimpan nisn, arahkan suruh isi dulu / login ulang
            return redirect()->to(base_url('pendaftaran'))
                ->with('error', 'NISN tidak ditemukan di sesi. Silakan login ulang / lengkapi pendaftaran.');
        }

        // Ambil pendaftaran terakhir berdasarkan NISN
        $pendaftaran = $db->table('pendaftaran')
            ->where('nisn', $nisn)
            ->orderBy('id_pendaftaran','DESC') // pastikan tabel pendaftaran punya kolom id (PK). kalau namanya beda, ganti.
            ->get()
            ->getRowArray();