app/Models/ModelSekolah.php

SELECT *
FROM `tbl_datasekolah`
ORDER BY `id_sekolah` ASC
---
    public function getAllSekolah()
    {
        return $this->db->table('tbl_datasekolah')
            ->orderBy('id_sekolah', 'ASC')
            ->get()
            ->getResultArray();

SELECT *
FROM `tbl_datasekolah`
WHERE `nama_sekolah` LIKE '%SMA%' ESCAPE '!'
OR  `alamat` LIKE '%SMA%' ESCAPE '!'
ORDER BY `id_sekolah` ASC
---
    public function searchSekolah($keyword)
    {
        return $this->db->table('tbl_datasekolah')
            ->like('nama_sekolah', $keyword)
            ->orLike('alamat', $keyword)
            ->orderBy('id_sekolah', 'ASC')
            ->get()
            ->getResultArray();