app/Models/ModelAuth.php

    public function login_user($email, $password)
    {
        return $this->db->table('tbl_user')->where(
            [
                'email' => $email,
                'password'  => $password
            ]
        )->get()->getRowArray();
---
SELECT *
FROM `tbl_user`
WHERE `email` = 'admin@gmail.com'
AND `password` = '1234'